{
    "Побег из Шоушенка": "(англ. The Shawshank Redemption — «Искупление Шоушенком») — американский драматический фильм 1994 года, режиссёра и сценариста Фрэнком Дарабонтом, основанный на повести Стивена Кинга «Рита Хейуорт и спасение из Шоушенка». Он рассказывает историю банкира Энди Дюфрена (Тим Роббинс), который приговорён к пожизненному заключению в государственной тюрьме Шоушенка за убийство своей жены и её любовника, несмотря на его заявления о невиновности. В течение следующих двух десятилетий он дружит с другим заключённым, контрабандистом Эллисом «Редом» Реддингом (Морган Фриман), и играет важную роль в операции по отмыванию денег, возглавляемой тюремным надзирателем Сэмюэлем Нортоном (Боб Гантон). Уильям Сэдлер, Клэнси Браун, Гил Беллоуз и Джеймс Уитмор появляются во второстепенных ролях.",
    "Начало": "(англ. Inception, буквально — начало процесса или организации, зарождение, исток; по сюжету — искусственное инициирование третьими лицами зарождения определённой идеи в сознании другого человека, в ходе действия фильма этот же англоязычный термин переводится словом «внедрение») — научно-фантастический триллер Кристофера Нолана, основанный на идее осознанных сновидений.",
    "Джокер": "(англ. Joker) — американский психологический триллер режиссёра Тодда Филлипса по сценарию, написанному Филлипсом совместно со Скоттом Сильвером. Главную роль исполняет Хоакин Феникс. Сюжет картины является версией предыстории суперзлодея Джокера, одного из ключевых антагонистов Бэтмена в комиксах компании DC Comics.",
    "Эрин Брокович": "(англ. Erin Brockovich) — американский драматический фильм-байопик 2000 года режиссёра Стивена Содерберга по сценарию Сюзанны Грант. Фильм основан на реальной истории правозащитницы Эрин Брокович, боровшейся против корпорации Pacific Gas and Electric Company, которая загрязняла грунтовые воды сообщества Хинкли штата Калифорния канцерогенным шестивалентным хромом и тем самым вызывала онкологические заболевания у горожан. Главные роли исполнили Джулия Робертс, Альберт Финни и Аарон Экхарт. В начале фильма также появляется реальная Эрин Брокович, сыгравшая эпизодическую роль официантки ресторана по имени Джулия Р.",
    "1+1": "(фр. Intouchables — «Неприкасаемые») — французская комедийная драма 2011 года, основанная на реальных событиях об успешном аристократе Филиппе, который в результате несчастного случая оказывается в инвалидном кресле и берёт себе в качестве помощника чернокожего, бывшего мелкого правонарушителя — Дрисса.",
    "Назад в будущее": " (англ. Back to the Future) — американский научно-фантастический фильм режиссёра Роберта Земекиса. Сценарий написали Земекис и Боб Гейл, исполнительные продюсеры — Стивен Спилберг, Фрэнк Маршалл и Кэтлин Кеннеди. Главные роли исполнили Майкл Джей Фокс, Кристофер Ллойд, Лиа Томпсон, Криспин Гловер и Томас Ф. Уилсон. По сюжету, подросток Марти Макфлай случайно попадает из 1985 года в 1955, где мешает знакомству своих юных родителей."
    }