# 17. Дан список чисел. Определите, сколько в нем встречается различных чисел.

list = [1, 2, 3, 1, 2, 3, 4, 5]
set = set(list)
print(len(set))




